TexasInstruments/mcupsdk-core-k3/test/drivers/mcspi/mcspi/am62x-sk/m4fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62x" --package "ALW" --part "Default" --context "m4fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.2+4234"}
 */

/**
 * Import the modules used in this configuration.
 */
const mcspi           = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1          = mcspi.addInstance();
const mcspi2          = mcspi.addInstance();
const mcspi3          = mcspi.addInstance();
const mcspi4          = mcspi.addInstance();
const mcspi5          = mcspi.addInstance();
const addr_translate  = scripting.addModule("/kernel/dpl/addr_translate", {}, false);
const addr_translate1 = addr_translate.addInstance();
const addr_translate2 = addr_translate.addInstance();
const addr_translate3 = addr_translate.addInstance();
const addr_translate4 = addr_translate.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
mcspi1.$name                 = "CONFIG_MCSPI0";
mcspi1.mode                  = "MULTI_MASTER";
mcspi1.inputSelect           = "0";
mcspi1.MCU_SPI.$assign       = "MCU_SPI0";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";

mcspi2.$name                 = "CONFIG_MCSPI1";
mcspi2.inputSelect           = "0";
mcspi2.mode                  = "MULTI_MASTER";
mcspi2.MCU_SPI.$assign       = "MCU_SPI1";
mcspi2.mcspiChannel[0].$name = "CONFIG_MCSPI_CH1";

mcspi3.useMcuDomainPeripherals = false;
mcspi3.mode                    = "MULTI_MASTER";
mcspi3.intrEnable              = "POLLED";
mcspi3.$name                   = "CONFIG_MCSPI3";
mcspi3.inputSelect             = "0";
mcspi3.SPI.$assign             = "SPI1";
mcspi3.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH2";

mcspi4.$name                   = "CONFIG_MCSPI4";
mcspi4.useMcuDomainPeripherals = false;
mcspi4.inputSelect             = "0";
mcspi4.intrEnable              = "POLLED";
mcspi4.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH3";
mcspi4.SPI.$assign             = "SPI0";

mcspi5.$name                   = "CONFIG_MCSPI2";
mcspi5.useMcuDomainPeripherals = false;
mcspi5.inputSelect             = "0";
mcspi5.intrEnable              = "POLLED";
mcspi5.mode                    = "MULTI_MASTER";
mcspi5.SPI.$assign             = "SPI2";
mcspi5.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH4";

addr_translate1.$name     = "CONFIG_ADDR_TRANSLATE_REGION0";
addr_translate1.localAddr = 0x80000000;

addr_translate2.$name      = "CONFIG_ADDR_TRANSLATE_REGION1";
addr_translate2.systemAddr = 0x20000000;
addr_translate2.localAddr  = 0xA0000000;

addr_translate3.$name      = "CONFIG_ADDR_TRANSLATE_REGION2";
addr_translate3.systemAddr = 0x40000000;
addr_translate3.localAddr  = 0xC0000000;

addr_translate4.$name      = "CONFIG_ADDR_TRANSLATE_REGION3";
addr_translate4.systemAddr = 0x60000000;
addr_translate4.localAddr  = 0x60000000;

debug_log.enableUartLog = true;
debug_log.uartTrace     = true;
debug_log.uartLog.$name = "CONFIG_UART0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 18;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION3";
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.baseAddr          = 0x79100000;
mpu_armv73.size              = 19;

mpu_armv74.$name             = "CONFIG_MPU_REGION4";
mpu_armv74.baseAddr          = 0x60000000;
mpu_armv74.size              = 28;
mpu_armv74.accessPermissions = "Supervisor RD, User RD";

mpu_armv75.$name    = "CONFIG_MPU_REGION5";
mpu_armv75.baseAddr = 0x80000000;
mpu_armv75.size     = 31;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
mcspi1.MCU_SPI.CLK.$suggestSolution             = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$suggestSolution              = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$suggestSolution              = "MCU_SPI0_D1";
mcspi1.mcspiChannel[0].MCU_CSn.$suggestSolution = "MCU_SPI0_CS0";
mcspi2.MCU_SPI.CLK.$suggestSolution             = "WKUP_UART0_RTSn";
mcspi2.MCU_SPI.D0.$suggestSolution              = "MCU_UART0_CTSn";
mcspi2.MCU_SPI.D1.$suggestSolution              = "MCU_UART0_RTSn";
mcspi2.mcspiChannel[0].MCU_CSn.$suggestSolution = "WKUP_UART0_CTSn";
mcspi3.SPI.CLK.$suggestSolution                 = "MMC0_DAT2";
mcspi3.SPI.D0.$suggestSolution                  = "MMC0_DAT7";
mcspi3.SPI.D1.$suggestSolution                  = "MMC0_DAT6";
mcspi3.mcspiChannel[0].CSn.$suggestSolution     = "MMC0_DAT3";
mcspi4.mcspiChannel[0].CSn.$suggestSolution     = "SPI0_CS0";
mcspi4.SPI.CLK.$suggestSolution                 = "SPI0_CLK";
mcspi4.SPI.D0.$suggestSolution                  = "SPI0_D0";
mcspi4.SPI.D1.$suggestSolution                  = "SPI0_D1";
mcspi5.SPI.CLK.$suggestSolution                 = "MMC0_DAT0";
mcspi5.SPI.D0.$suggestSolution                  = "MMC0_DAT5";
mcspi5.SPI.D1.$suggestSolution                  = "MMC0_DAT4";
mcspi5.mcspiChannel[0].CSn.$suggestSolution     = "MMC0_DAT1";
debug_log.uartLog.MCU_UART.$suggestSolution     = "MCU_USART0";
debug_log.uartLog.MCU_UART.RXD.$suggestSolution = "MCU_UART0_RXD";
debug_log.uartLog.MCU_UART.TXD.$suggestSolution = "MCU_UART0_TXD";
